Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: །འཕགས་པའི་ལམ་ཡང་གནས་པ་མེད་པའོ།
en: The path of the noble ones does not remain anywhere.

source: །གནས་མེད་པ་ལ་རྣམ་པར་ཤེས་པ་གནས་པ་མེད་དོ།
en: Where there is no remaining, there is also no support for consciousness.

source: །རྣམ་པར་ཤེས་པ་གནས་པ་མེད་ན་འཕགས་པའི་ལམ་ལ་གནས་པ་ཞེས་བྱའོ།
en: And when consciousness is not supported, that is referred to as remaining on the path.

source: །འཕགས་པའི་ལམ་གྱི་གནས་གང་ཡིན་པ་དེ་ནི་མིག་གི་གནས། རྣ་བའི་གནས། སྣའི་གནས། ལྕེའི་གནས། ལུས་ཀྱི་གནས། ཡིད་ཀྱི་གནས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: That which is the support of the path of the noble ones is also the support of the eyes, the support of the ears, the support of the nose, the support of the tongue, the support of the body, and the support of the mind. And why?

source: མིག་ནི་མིག་གིས་དབེན་ནོ།
en: The eyes are devoid of eyes.

source: །དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་ཡིད་ཀྱིས་དབེན་ནོ།
en: Likewise, the ears, the nose, the tongue, the body, and the mind are also devoid of themselves.

source: །ཅིས་དབེན་ཞེ་ན་འདས་པས་དབེན་ནོ། །མ་འོངས་པས་དབེན་ནོ། །ད་ལྟར་བྱུང་བས་དབེན་ནོ།
en: If you wonder how they are devoid, they are void of past, future, and present.

source: །མིག་གི་དབེན་པ་ལ་མིག་གི་དབེན་པ་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་ནོ།
en: As for the eyes being void, their voidness is neither existent nor nonexistent.

source: །དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་དབེན་པ་ལ་ཡིད་ཀྱི་དབེན་པ་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་ནོ།
en: Likewise, as for the ears, the nose, the tongue, the body, and the mind being void, their voidness is neither existent nor nonexistent.

source: །གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་། ཆོས་ཀྱི་དབེན་པ་ལ་ཆོས་ཀྱི་དབེན་པ་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In the case of form, sound, smell, taste, texture, and mental phenomena, their voidness is neither existent nor nonexistent. And why?

source: བདག་དང་བདག་གི་དང་། རྟག་པ་དང་བརྟན་པ་དང་། ཐེར་ཟུག་དང་མི་འགྱུར་བའི་ཆོས་ཅན་ཤིན་ཏུ་དབེན་པའི་ཕྱིར་ཏེ།
en: Because it is utterly devoid of a self and anything that belongs to a self. It is entirely devoid of anything that is permanent, stable, solid, or immutable.

source: སྟོང་པ་ཞེས་ཀྱང་མི་བརྗོད། མི་སྟོང་པ་ཞེས་ཀྱང་མི་བརྗོད་ཀྱི་དེ་ནི་འདས་པ་ཞེས་ཀྱང་མི་བརྗོད་ལ། འདས་པ་མ་ཡིན་པ་ཞེས་ཀྱང་མི་བརྗོད་དོ། །མ་འོངས་པ་ཞེས་ཀྱང་མི་བརྗོད་ལ། མ་འོངས་པ་མ་ཡིན་པ་ཞེས་ཀྱང་མི་བརྗོད་དོ།
en: Hence, it cannot be described as either empty or not empty, nor can it be described as either past or not past, future or not future, or present or not present.

source: །ད་ལྟར་བྱུང་བ་ཞེས་ཀྱང་མི་བརྗོད་ལ། ད་ལྟར་བྱུང་བ་མ་ཡིན་པ་ཞེས་ཀྱང་མི་བརྗོད་དོ། །འདི་ནི་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་ཞེས་ཀྱང་མི་བརྗོད་ལ།
en: Thus, it cannot be said to be past, present, or future.

source: བརྗོད་པ་ཡང་མ་ཡིན་ནོ།
en: It cannot be described in such terms.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་འདས་པས་སྟོང་ངོ་། །མ་འོངས་པས་སྟོང་ངོ་། །ད་ལྟར་བྱུང་བས་སྟོང་ངོ་།
en: And why? Because it is empty of the past, the future, and the present.

source: །གང་འདས་པས་སྟོང་པ་དང་མ་འོངས་པས་སྟོང་པ་དང་ད་ལྟར་བྱུང་བས་སྟོང་པ་དེ་ནི་འདས་པས་དག་པའོ། །མ་འོངས་པས་དག་གོ། །ད་ལྟར་བྱུང་བས་དག་གོ།
en: That which is empty of past, future, and present is also pure in terms of past, future, and present.

source: །འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། གང་གཞོམ་པ་མ་ཡིན་པ་དེ་གཞོམ་པར་ནུས་སམ། གསོལ་པ།
en: Mañjuśrī, tell me, is it possible to destroy the indestructible?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མི་ནུས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Mañjuśrī replied, “No, Blessed One, it is not. And why?

source: དེ་ནི་མཉམ་པ་ལགས་ཏེ། ནམ་དུ་ཡང་མི་མཉམ་པར་མི་འགྱུར་རོ།
en: Because it remains the same and will never be anything but the very same.”

source: །འཇམ་དཔལ་དེ་བཞིན་ཏེ། དེ་བཞིན་གཤེགས་པས་མི་མཉམ་པ་མེད་པར་ཆོས་བསྟན་ཏོ།
en: The Blessed One said, “In the same way, Mañjuśrī, the Thus-Gone One’s teaching of the Dharma remains nothing but the same.

source: །འཇམ་དཔལ་གང་མི་མཉམ་པ་མེད་ན་མི་གཞོམ་པའོ།
en: Mañjuśrī, if something remains nothing but the same, it cannot be destroyed.

source: །གང་གཞོམ་པ་མ་ཡིན་ཞིང་མཉམ་པ་དེ་ནི་མི་མཉམ་པ་མེད་པའོ། །ལྟོས་པ་མེད་པའོ།
en: That which is indestructible and remains the same does not contain anything that is not the same.

source: །འཇུག་པ་མེད་པའོ། །འགྲོ་བ་མེད་པའོ།
en: It is not dependent, does not come, and does not go.

source: །འགྲོ་བ་ཡང་དག་པར་ཆད་པའོ།
en: It is the true end of going.

source: །ཤེས་པར་བྱ་བ་མ་ཡིན་པའོ།
en: It cannot be known.

source: །གང་དག་གིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ཞེ་ན།
en: By what means is it unknowable?

source: མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་རྣམས་ཀྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: It cannot be known through the ears, the nose, the tongue, the body, and the mind.

source: །འདུ་བྱེད་དུ་གྱུར་པ་ཐམས་ཅད་ཀྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: It cannot be known by means of any type of conditioning.

source: །དེ་ནི་ལུས་ཀྱི་འདུ་བྱེད་དང་ངག་གི་འདུ་བྱེད་དང་། ཡིད་ཀྱི་འདུ་བྱེད་འགགས་པའོ།
en: It is the cessation of all conditioning related to body, speech, and mind.

source: །ཅིའི་རྒྱུས་འགག །ཅི་སྔོན་བྱུང་བ་ལ་དེ་དག་ཕྱིས་འགགས་པ་ཞིག་གམ།
en: What causes this cessation? Is this the cessation of something that arose in the past and then subsequently ceased?

source: འོན་ཏེ་འདས་པ་ན་ཞིག་པས་འགགས་སམ།
en: Or is this a cessation in terms of something that was destroyed in the past?

source: གང་ཞིག་པས་འགགས།
en: Is there something that ceases by being destroyed?

source: དེ་སྔོན་མི་ཤེས་པ་ལ་རབ་ཏུ་གནས་པས་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་དོ།
en: The conditioning of nonvirtuous karma is produced because previously one remained in ignorance.

source: །དེ་ཤེས་ནས་མངོན་པར་འདུ་མི་བྱེད་དོ།
en: Yet with knowledge of this fact, conditioning ceases.

source: །གང་སྔོན་འཕགས་པའི་ཆོས་ལ་མ་བརྟེན་ཏེ། མི་ཤེས་པ་ལ་རབ་ཏུ་གནས་པས་མི་དགེ་བའི་ལས་བྱེད་པ་དེ་
en: If one previously did not rely on the Dharma of the noble ones but remained in ignorance, one would perform nonvirtuous actions.

source: འཕགས་པའི་ལམ་ལ་བརྟེན་ཏེ།ཡེ་ཤེས་ཀྱིས་རྟོགས་ནས་མངོན་པར་འདུ་བྱེད་དོ།
en: Yet when one relies on the path of the noble ones, one gains realization through wisdom, and thus conditioning will cease.

source: །གང་ཡེ་ཤེས་ཀྱིས་སྟོང་པ་དེ་སྟོང་པ་ཉིད་དེ། མིག་ནི་ཡེ་ཤེས་ཀྱིས་སྟོང་ངོ་། །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱང་དེ་བཞིན་ནོ།
en: “That which is empty of wisdom is emptiness. The eye is empty of wisdom and so are the ears, the nose, the tongue, the body, and the mind.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཡེ་ཤེས་ནི་ཡེ་ཤེས་ཀྱིས་སྟོང་སྟེ། སྟོང་པ་ཉིད་མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་དོ།
en: Why is that? Because wisdom is empty of wisdom. And emptiness is the eyes, the ears, the nose, the tongue, the body, and the mind.

source: །ཡིད་མི་དམིགས་པས་མིག་མིག་ལ་མི་གནས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Since the mind is not observed, the eye does not contain any eye. And why?

source: ཤིན་ཏུ་མ་སྐྱེས་པའི་ཕྱིར་མིག་མི་གནས་ཏེ།
en: Utterly unborn, the eye does not remain.

source: རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱང་དེ་བཞིན་ནོ།
en: The same applies to the ears, the nose, the tongue, the body, and the mind.

source: །ཡིད་མི་དམིགས་པས་མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱང་ཡིད་ལ་མི་གནས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: When the mind is not observed, the eyes, the ears, the nose, the tongue, the body, and the mind do not remain in the mind. And why?

source: མིག་ཤིན་ཏུ་མ་སྐྱེས་པའི་ཕྱིར་ཏེ།
en: Because the eye is utterly unborn.

source: མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱང་མི་གནས་སོ།
en: Thus, the eyes, the ears, the nose, the tongue, the body, and the mind do not remain.

source: །དེ་མི་གནས་པས་བསིལ་བར་གྱུར་པ། དབེན་པའི་སེམས་ཀྱིས་གནས་སོ།
en: Since they do not remain, they are serene, and thus one now abides by means of a mind of seclusion.

source: །དབེན་པ་ཅི་ཞེ་ན།
en: “What is meant by ‘seclusion’?

source: འཇམ་དཔལ་གང་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་མཐའ་དང་། གཉིས་སུ་མེད་པའི་མཐའ་དང་། ཡང་དག་པའི་མཐའ་དང་། ཤིན་ཏུ་འབྱུང་བ་མེད་པའི་མཐའ་དེ་ནི་དབེན་པ་ཞེས་བྱའོ།
en: Mañjuśrī, ‘seclusion’ refers to the limit of the sameness of all phenomena, the limit of nonduality, the limit of reality, and the limit of non-occurrence.

source: །འཇམ་དཔལ་དབེན་པ་ལ་ནི་སྐྱེ་བ་དང་རྒ་བ་དང་། འཆི་བ་མེད་དོ།
en: Mañjuśrī, in seclusion there is no birth, old age, or death.

source: །གང་ལ་སྐྱེ་བ་དང་རྒ་བ་དང་འཆི་བ་མེད་པ་དེ་ལ་སྡུག་བསྔལ་མེད་དོ།
en: Where there is no birth, old age, or death, there is no suffering.

source: །གང་ལ་སྡུག་བསྔལ་མེད་པ་དེ་ལ་སྡུག་བསྔལ་མི་འབྱུང་ངོ་།
en: Where there is no suffering, suffering does not arise.

source: །གང་ལ་སྡུག་བསྔལ་མི་འབྱུང་བ་དེ་འཇིགས་པ་མེད་དོ།
en: Where suffering does not arise, there is no fear.

source: །གང་འཇིགས་པ་མེད་པ་དེ་སེམས་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བའོ།
en: Where there is no fear, there is no mind or consciousness.

source: །གང་སེམས་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ་དེ་ནི་མ་སྐྱེས་མ་འགགས་པའོ།
en: Where there is no mind or consciousness, there is no birth and no cessation.

source: །གང་མ་སྐྱེས་པ་མ་འགགས་པ་དེ་དབེན་པ་སྟེ།
en: Where there is no birth and no cessation, there is seclusion.

source: དེ་དང་དེས་གནས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབེན་པར་གནས་པ་ཞེས་བྱའོ།
en: Since this is how the Thus-gone, worthy, perfect Buddha remains, it is said that he remains in seclusion.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ནི་གནས་པ་མེད་པའོ།
en: “Mañjuśrī, the Thus-Gone One does not remain.

source: །དེ་བཞིན་གཤེགས་པར་བརྟགས་པ་ནི་བརྟགས་པ་མེད་པའོ།
en: The examination of the Thus-Gone One is beyond examination.

source: །ཆོས་ཐམས་ཅད་མི་མཐོང་བ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའོ།
en: Not seeing any phenomena is seeing the Thus-Gone One.

source: །དེ་བཞིན་གཤེགས་པའི་ཚིག་ནི་ཚིག་ཐམས་ཅད་ལས་འདས་པ་སྟེ། བསྟན་དུ་མེད་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The words of the Thus-Gone One are beyond all words and cannot be set forth. And why?

source: འཇམ་དཔལ་ངས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཡི་གེ་དང་ངེས་པའི་ཚིག་གིས་བསྟན་པ་འགག་པའི་ཕྱིར་ཆོས་སྟོན་གྱི་
en: Because, Mañjuśrī, I teach the Dharma in terms of the cessation of the teaching of all letters and words as related to all phenomena.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ནི་ཡི་གེ་གཅིག་ཀྱང་མི་བརྗོད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཀྱི་འཇུག་པ་མེད་དོ།
en: Thus, Mañjuśrī, the Thus-Gone One does not utter a single syllable. And why? Because in the case of the Thus-Gone One there are no mental engagements.

source: །སེམས་ཀྱི་ལས་མེད་དོ། །སེམས་ལས་ངེས་པར་སེམས་པ་མེད་དོ།།སེམས་ཀྱི་རྒྱུ་བ་མེད་དོ།
en: He is beyond the workings of the mind and has no thoughts springing from the mind.

source: །སེམས་ཡོངས་སུ་རྟོགས་པ་མེད་དོ།
en: For him there is no activity of the mind, no ascertainment of the mind, and no movement of the mind.

source: །སེམས་ཀྱི་ཞི་གནས་མེད་དོ།
en: He is beyond all thoughts of the mind.

source: །སེམས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམ་པར་ཤེས་པ་མེད་དོ།
en: He has no basis for mind and is free from any consciousness that arises from mind.

source: །རང་གི་སེམས་ཀྱི་གནས་མེད་དོ། །གཞན་གྱི་སེམས་ཀྱི་གནས་མེད་དོ།
en: He has no place for a personal mind, nor does he have a place for the minds of others.

source: །དེ་བཞིན་གཤེགས་པ་ལ་གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་གནས་པའི་སེམས་མེད་དོ།
en: The Thus-Gone One does not have a mind that abides among form, feeling, perception, formation, and consciousness.

source: །མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ལ་གནས་པའི་སེམས་མེད་དོ།
en: He does not have a mind that abides in relation to the eyes, the ears, the nose, the tongue, the body, or the mind.

source: །དེ་བཞིན་གཤེགས་པ་ལ་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ལ་གནས་པའི་སེམས་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Thus-Gone One does not have a mind that abides in relation to form, sound, smell, taste, texture, or mental phenomena. And why?

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ནི་ཞི་བའོ། །བསིལ་བར་གྱུར་པའོ། །རྟག་ཏུ་མཉམ་པར་གཞག་པའོ། །མི་སྣང་བའོ། །བལྟར་མེད་པའོ། །མཐའ་ཡས་པའོ། །སྤྲིན་དང་མཚུངས་པའོ།
en: Because, Mañjuśrī, the Thus-Gone One is peaceful, serene, resting always in equanimity, not apparent, invisible, endless, and cloud-like.

source: །དེ་ལྟ་མོད་ཀྱི་འོན་ཀྱང་སེམས་ཅན་རྣམས་སྔོན་དགེ་བའི་རྩ་བའི་སྟོབས་བསྐྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྨོན་ལམ་དང་། སྤྱོད་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་།
en: Although that surely is the case, beings nevertheless perceive the Thus-Gone One. This is due to the power of their past roots of virtue combined with the past aspirations of the Thus-Gone One and the transformative power of his activity.

source: །ངེས་པར་སེམས་སོ། །ཀུན་ཏུ་འདྲིའོ།
en: Thus they can reflect on him and ask him questions.

source: །གང་དག་ཇི་ལྟར་དབང་པོ་ཡོངས་སུ་སྨིན་པའི་སེམས་ཅན་རྣམས་དང་། གང་དག་ཇི་ལྟར་འདུལ་བ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ལྟར་གསུང་འབྱིན་པར་ཤེས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Those with mature faculties and those who have been tamed are therefore able to hear his speech. And why?

source: དེ་བཞིན་གཤེགས་པ་མ་སྐྱེས་མ་འགགས་པའི་ཕྱིར་རོ།
en: Because the Thus-Gone One is unborn and unceasing.

source: །གང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མི་མཐོང་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའོ།
en: “Whoever does not see any nature in phenomena sees the Thus-Gone One.

source: །གང་ཆོས་གང་ཡང་མི་མཐོང་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Whoever does not see any phenomena sees the Thus-Gone One. And why?

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད་སྤངས་པ་སྟེ།
en: Because, Mañjuśrī, the Thus-Gone One is beyond all phenomena.

source: ཆོས་གང་གིས་ཀྱང་བརྗོད་པ་ཡང་མ་ཡིན། མི་བརྗོད་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: He can therefore not be described in terms of any phenomenon, and he is also beyond the absence of expression. And why?

source: ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: Because no phenomenon can be observed.

source: །གང་ཆོས་ཐམས་ཅད་དང་ཆོས་མ་ཡིན་པ་རྣམས་དང་འདུས་བྱས་རྣམས་དང་འདུས་མ་བྱས་པ་རྣམས་མི་དམིགས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Whoever does not observe any phenomena or non-phenomena, anything conditioned or unconditioned, sees the Thus-Gone One. And why?

source: ཆོས་གང་ཡང་ཁས་མི་ལེན་ཏོ། །ཉེ་བར་མི་ལེན་ཏོ། །ཆོས་སུ་བཏགས་པ་ཡང་མི་འགྲོའོ།
en: He does not accept any phenomena, does not appropriate any phenomena, and does not impute any phenomena.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་འགག་པ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏེ།
en: Mañjuśrī, the cessation of all phenomena is the Thus-gone, worthy, perfect Buddha.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དེ་བཞིན་གཤེགས་པ་མཐོང་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Seeing all phenomena as they truly are is to see the Thus-Gone One. And why?

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ནི་
en: Because, Mañjuśrī, regarding the Thus-Gone One, it is like this:

source: ཆོས་གང་གིས་ཀྱང་མཐོང་བར་མི་འགྲོ་སྟེ།དེ་བཞིན་གཤེགས་པ་དེ་ལྟར་མཐོང་ན་ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའོ་ཞེས་འཇུག་པར་འགྱུར་རོ།
en: If one does not perceive any phenomena, and if one sees the Thus-Gone One in that same way, then one will understand the statement, ‘All phenomena are the Thus-Gone One.’

source: །ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། མ་སྐྱེས་པ་དང་མ་འགགས་པའོ་ཞེས་འཇུག་པར་འགྱུར་རོ།
en: Moreover, one will understand the statement, ‘All phenomena are suchness, unmistaken suchness, and nothing but suchness—unborn and unceasing.’

source: །ཡུལ་མེད་པ་ཡུལ་དང་བྲལ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལོ་ཞེས་འཇུག་པར་འགྱུར་རོ།
en: ‘No object and beyond object—such is the domain of the Thus-Gone One.’

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་སོ།
en: “Mañjuśrī, bodhisattvas who rest in this absorption know with their single minds the mental activities of all beings.

source: །དེ་རང་གི་སེམས་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: Due to the sameness of their own minds, they realize the minds of all beings to be sameness.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རང་གི་སེམས་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: And due to the sameness of the minds of all beings, they realize their own minds to be sameness.

source: སེམས་སྒྱུ་མ་ལྟ་བུའི་ཕྱིར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཕྱིར་རོ།
en: Because mind is illusory and because the minds of all beings are naturally luminous.

source: །དེ་རང་གི་ལུས་ཆོས་ཉིད་ཀྱི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཆོས་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཆོས་ཉིད་ཀྱི་ཕྱིར་རང་གི་ལུས་ཆོས་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: As their own bodies are the natural state, they realize the bodies of all beings to be the natural state. And why?

source: ལུས་ཐམས་ཅད་ནི་གཟུགས་བརྙན་ལྟ་བུའི་ཕྱིར་རང་གི་ལུས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་འཇུག་ཅིང་ཡང་དག་པར་འདུའོ།
en: Since all bodies are like reflections, they can let the bodies of all beings enter and merge with their own bodies.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ལ་ཡང་རང་གི་ལུས་རྗེས་སུ་འཇུག་ཅིང་ཡང་དག་པར་འདུའོ།
en: They can also make their own bodies follow and merge with the bodies of all beings.

source: །འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ལ་སངས་རྒྱས་ཀྱི་སྐུ་བྱིན་གྱིས་རློབ་སྟེ།
en: To properly train others, the body of the Buddha can transform into the body of any being.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡང་དེ་བཞིན་ནོ།
en: That is also how it is according to the vehicles of the hearers and the solitary buddhas.

source: །རང་གི་ལུས་དང་རང་གི་ལུས་མ་ཡིན་པ་དང་ཞིང་གི་ཚོགས་བྱིན་གྱིས་རློབ་བོ།
en: He can transform his own body, the bodies of others, and various realms.

source: །དེ་བཞིན་དུ་སའི་ཁམས་དང་ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་ཀྱང་ཇི་ལྟར་འདོད་པ་དེ་བཞིན་དུ་བྱིན་གྱིས་རློབ་སྟེ།
en: Likewise, according to his wishes, he can transform the lement of earth into the element of water, the element of fire, or the element of wind.

source: ཆུའི་ཁམས་དང་སའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་སུ་བྱིན་གྱིས་རློབ་བོ།
en: He can transform the element of water into the element of earth, the element of fire, or the element of wind.

source: །མེའི་ཁམས་དང་སའི་ཁམས་དང་ཆུའི་ཁམས་དང་རླུང་གི་ཁམས་སུ་བྱིན་གྱིས་རློབ་བོ།
en: He can transform the element of fire into the element of earth, the element of water, or the element of wind.

source: །རླུང་གི་ཁམས་དང་སའི་ཁམས་དང་ཆུའི་ཁམས་དང་མེའི་ཁམས་སུ་བྱིན་གྱིས་རློབ་བོ།
en: He can transform the element of wind into the element of earth, the element of water, or the element of fire.

source: །དེའི་བྱིན་གྱིས་བརླབས་དེ་ནི་བརྒྱ་བྱིན་ནམ། ཚངས་པའམ། བདུད་དམ། གཞན་གང་གིས་ཀྱང་འཇིག་རྟེན་ན་ཆོས་དང་འཐུན་པར་བསྐུལ་པའམ། །སྤྱོད་པར་ནུས་པའི་དེ་ལྟ་བུའི་གནས་མེད་དོ།
en: His transformative power is such that it would be impossible for anyone else in the world, whether Śakra, Brahmā, or Māra, to inspire or bring alignment with the Dharma to the same degree.

source: །འཇམ་དཔལ་སྤྱོད་པ་འདི་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གཟུགས་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་མངོན་པར་ཤེས་པ་དྲུག་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་བྱིན་གྱི་རླབས་བཞི་ཡང་དག་པར་འཇུག་གོ།
en: “Mañjuśrī, the four types of correct understanding, the six types of superknowledge, the thirty-seven factors of awakening, and the four transformative powers will enter the bodies of the bodhisattva great beings, who aspire to this activity.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་མངོན་པར་ཤེས་པ་དྲུག་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་བྱིན་གྱི་རླབས་བཞི་ཇི་ལྟར་ཡང་དག་པར་འཇུག་ཅེ་ན།
en: Mañjuśrī, how do the four types of correct understanding, the six types of superknowledge, the thirty-seven factors of awakening, and the four transformative powers enter the bodies of such bodhisattva great beings?

source: འཇམ་དཔལ་གང་གཟུགས་མི་དམིགས་པའི་ཤེས་པ་དེ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: “Mañjuśrī, when the bodhisattvas’ consciousness does not observe form, they correctly apprehend the meaning.

source: །གང་དོན་ཇི་ལྟ་བ་བཞིན་དུ་རྟོན་པ་དེ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: By relying on the actual meaning, they correctly understand the Dharma.

source: །གང་ཆོས་མི་སྐྱེ་མི་འབྱུང་མི་འགག་པར་རྟོགས་པ་དེ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: When the bodhisattvas realize that phenomena are unborn, unmanifest, and unceasing, they gain a correct understanding of language.

source: །གང་ངེས་པའི་ཚིག་གིས་ངེས་པར་རྟོགས་པ་འདི་ནི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: When they gain certainty of language, they obtain correct understanding of eloquence.

source: །གང་གཟུགས་རྣམ་པར་མཐོང་བ་ན་ཁམས་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་ལ་མིག་ཆགས་པ་མེད་ཅིང་སྒྲིབ་པ་མེད་པ་དེ་ནི། དེའི་མིག་གི་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་པའོ།
en: “When, upon seeing form, the bodhisattvas keep their eyes unattached and unobscured with regard to the elements and sense sources, they obtain an unimpaired visual superknowledge.

source: །གང་གཟུགས་ལ་ཡི་གེ་གཅིག་བརྗོད་པས་གཟུགས་ཀྱི་དོན་ཐམས་ཅད་ཐོས་པ་དེ་ནི་དེའི་རྣ་བ་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་ཅིང་ཆགས་པ་མེད་དེ་སྒྲིབ་པ་མེད་པའོ།
en: As they hear all meanings related to form even when just a single syllable is being uttered, they attain an unimpaired, unattached, and unobscured aural superknowledge.

source: །གང་གཟུགས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སེམས་ལས་བྱུང་བ་རྣམས་ལ་ཆགས་པ་མེད་ཅིང་དབྱེར་མེད་པར་སེམས་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པ་ཤེས་པ་དེ་ནི་དེའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་ཅིང་ཆགས་པ་མེད་དེ་སྒྲིབ་པ་མེད་པའོ།
en: As they know the minds and mind states of all beings while remaining unattached and beyond separation, they achieve an unimpaired, unattached, and unobscured superknowledge of the minds of others.

source: །གང་གཟུགས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་སྣང་བ་ལ་གཅིག་ཏུ་མཉམ་པ་ཉིད་དུ་འཇུག་པ་ཤེས་པ་དེ་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་ཅིང་ཆགས་པ་མེད་དེ་སྒྲིབ་པ་མེད་པའོ།
en: As they know the mental experiences of all beings to be nothing but sameness, they obtain an unimpaired, unattached, and unobscured superknowledge that recollects previous births.

source: །གང་གཟུགས་ཀྱི་སྔོན་དང་ཕྱི་མའི་མིང་དང་ངེས་པའི་ཚིག་མཐའ་ཡས་པ་ལ་མི་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱིས་ལྷག་པའི་བསམ་པས་འཇུག་པ་དེ་ནི་དེའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་ཅིང་ལྷུན་གྱིས་གྲུབ་སྟེ།ཆགས་པ་མེད་ཅིང་སྒྲིབ་པ་མེད་པའོ།
en: As they act altruistically by means of a discipline that does not observe former and future words or the limitless forms of language, they develop an unimpaired, spontaneous, unattached, and unobscured superknowledge of miraculous manifestations.

source: །གང་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་དུས་ལ་འདོད་ཆགས་མེད་ཅིང་འདོད་ཆགས་དང་བྲལ་བའི་ཚུལ་གྱིས་གཟུགས་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་གཏི་མུག་གིས་མི་གོས་པར་ཤེས་པ་དེ་ནི་
en: They are without desire—whether in the past, the future, or the present—and, being free from desire, their minds are unstained by attachment, anger, and delusion.

source: དེའི་ཟག་པ་ཟད་པའི་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་ཅིང་ཆགས་པ་མེད་དེ་སྒྲིབ་པ་མེད་པའོ།
en: Thus, they attain an unimpaired, unattached, and unobscured superknowledge with regard to actualizing an undefiled mind.

source: །གང་མཉམ་པ་ཉིད་དུ་ཤེས་པའི་ཚུལ་གྱིས་གཟུགས་ལ་མི་སྐྱེ་མི་འགག་མི་གནས་པར་ཤེས་པ་དེ་ནི་དེའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ།
en: “Since they understand by means of sameness, they know that form is unborn, unceasing, and non-abiding. That is the application of mindfulness of the body that accords with the body.

source: །གང་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་གཟུགས་ལ་མྱོང་བ་སྐྱེ་བ་མེད་པར་ཤེས་པ་དེ་ནི་དེའི་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ།
en: With the knowledge of sameness, they understand that experiences concerning form are unborn. That is the application of mindfulness of sensations that accords with sensations.

source: །མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་གང་གཟུགས་ལ་དམིགས་པ་དེ་དང་དེ་ལ་སེམས་མེད་ཅིང་སེམས་ཡོད་པ་མ་ཡིན་ཏེ།
en: With the knowledge of sameness, they understand that the various observations of form are divorced from the mind and do not involve it.

source: སེམས་དང་བྲལ་བ་དེ་ནི་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ།
en: That absence of mind is the application of mindfulness of the mind that accords with the mind.
